tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
void IrrigationWeb::overview() {
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        if (!Esp32BaseWeb::checkPostAllowed("irrigation_manual_watering")) return;
        bool success = false;
        if (actionIs("stop")) {
            const WateringStatus status = g_app->wateringStatus();
            success = status.active && status.purpose == WateringPurpose::Normal &&
                      g_app->stopWatering();
        } else if (actionIs("start_zones")) {
            std::array<uint16_t, BoardPins::kZoneCount> durations{};
            success = true;
            for (uint8_t index = 0; index < durations.size(); ++index) {
                char name[8];
                std::snprintf(name, sizeof(name), "zone%u", index + 1U);
                uint32_t duration = 0;
                if (Esp32BaseWeb::hasParam(name) && !uintParam(name, 0, 120, duration)) {
                    success = false;
                    break;
                }
                durations[index] = static_cast<uint16_t>(duration);
            }
            success = success && g_app->startManualWatering(durations) ==
                                     WateringStartResult::Started;
        }
        redirectResult("/irrigation", success);
        return;
    }
    const WateringStatus watering = g_app->wateringStatus();
    if (watering.active) {
        activeTask();
        return;
    }
    if (!Esp32BaseWeb::checkAuth()) return;
    Esp32BaseWeb::sendHeader("智能浇水");
    Esp32BaseWeb::sendChunk(
        R"HTML(<style>
.home-hero{display:grid;grid-template-columns:minmax(0,1fr) auto;gap:18px;align-items:center;padding:20px;border:1px solid var(--eb-line);border-radius:12px;background:linear-gradient(135deg,#f4faf7,#fff);margin:12px 0}
.home-hero.warn{background:linear-gradient(135deg,var(--eb-warn-soft),#fff);border-color:#efcf96}.home-hero.danger{background:linear-gradient(135deg,var(--eb-danger-soft),#fff);border-color:#efc0ba}.home-hero.info{background:linear-gradient(135deg,var(--eb-info-soft),#fff);border-color:#cbdde5}
.home-eyebrow{display:block;margin-bottom:5px;color:var(--eb-muted);font-size:12px;font-weight:750}.home-hero h1{margin:0 0 6px;font-size:24px}.home-hero p{margin:0;color:var(--eb-muted)}.home-monitor{display:block;margin-top:7px;color:var(--eb-muted);font-size:12px}.home-monitor.danger{color:var(--eb-danger)}.home-hero .btnlink{min-height:38px;padding:0 16px}.home-action.hidden{display:none}
.home-hero-side{display:flex;align-items:center;justify-content:flex-end;gap:20px}.home-clock{width:170px}.home-clock.has-warning{width:250px}.home-clock-time{display:block;color:inherit;font-size:24px;font-weight:700;font-variant-numeric:tabular-nums;line-height:1.1}.home-clock-date{display:block;margin-top:5px;color:var(--eb-muted);font-size:12px;font-weight:400;white-space:nowrap}.home-clock-warning{display:inline-flex;margin-top:7px;padding:3px 7px;border:1px solid #efcf96;border-radius:999px;background:var(--eb-warn-soft);color:#8a5708;font-size:11px;font-weight:500;line-height:1.35;text-decoration:none}.home-clock.pending .home-clock-time{color:var(--eb-warn);font-size:16px}.home-clock.pending .home-clock-date{white-space:normal}
.home-grid{display:grid;grid-template-columns:repeat(2,minmax(0,1fr));gap:12px;margin:12px 0}.home-card{display:flex;flex-direction:column;min-height:230px;padding:18px;border:1px solid var(--eb-line);border-radius:12px;background:#fff}.home-card-head{display:flex;align-items:center;justify-content:space-between;gap:10px;margin-bottom:14px}.home-card-head h2{margin:0;font-size:17px}.home-main{font-size:22px;font-weight:760;line-height:1.3;overflow-wrap:anywhere}.home-sub{margin:6px 0 0;color:var(--eb-muted);overflow-wrap:anywhere}.home-plan{margin-top:14px;padding:11px 12px;border-radius:9px;background:var(--eb-soft)}.home-plan span{display:block;color:var(--eb-muted);font-size:11px}.home-plan b{display:block;margin-top:3px;font-size:17px;font-weight:600;overflow-wrap:anywhere}.home-outcome{margin:14px 0 0;padding:10px 12px;border-radius:9px;background:var(--eb-soft);font-size:14px;line-height:1.55}.home-card.danger{border-color:#efc0ba;background:linear-gradient(150deg,#fff,var(--eb-danger-soft))}.home-card.warn{border-color:#efcf96;background:linear-gradient(150deg,#fff,var(--eb-warn-soft))}.home-card.ok{border-color:#c8e4d5}.home-card.just-finished{animation:home-result-highlight 3.5s ease-out}.home-facts{display:grid;gap:7px;margin:14px 0 0}.home-fact{display:grid;grid-template-columns:6.5em minmax(0,1fr);gap:8px;font-size:13px}.home-fact span:first-child{color:var(--eb-muted)}.home-card-actions{display:flex;align-items:center;gap:8px;margin-top:auto;padding-top:16px}.home-card-actions form{margin:0}.home-empty{color:var(--eb-muted);line-height:1.7}.home-note{margin-top:10px;padding:10px 12px;border-radius:8px;background:var(--eb-soft);color:var(--eb-muted);font-size:13px}@keyframes home-result-highlight{0%{box-shadow:0 0 0 4px rgba(17,123,139,.22)}100%{box-shadow:0 0 0 0 rgba(17,123,139,0)}}
.manual-modal{width:min(760px,calc(100vw - 28px));padding:20px!important}.manual-template{margin:14px 0}.manual-template-head{display:flex;align-items:center;justify-content:space-between;gap:10px;margin-bottom:7px}.manual-template-head h3{margin:0;font-size:14px;font-weight:500}.manual-template-head a{font-size:12px}.manual-template-list{display:grid;grid-template-columns:repeat(2,minmax(0,1fr));gap:8px}.manual-template-card{display:block;min-width:0;min-height:76px;padding:10px 11px;border:1px solid var(--eb-line-soft);border-radius:8px;background:var(--eb-soft);color:var(--eb-text);text-align:left}.manual-template-card:hover{border-color:#a9cbd3;background:#f5fafb}.manual-template-card.selected{border-color:var(--eb-primary);background:var(--eb-primary-soft);box-shadow:0 0 0 1px var(--eb-primary)}.manual-template-card:disabled{opacity:.58;cursor:not-allowed}.manual-template-card b,.manual-template-card span,.manual-template-card small{display:block}.manual-template-card b{font-size:14px;font-weight:500}.manual-template-card span{margin-top:4px;color:#526071;font-size:12px;line-height:1.4;overflow-wrap:anywhere}.manual-template-card small{margin-top:3px;color:var(--eb-muted);font-size:11px}.manual-template-empty{padding:10px 11px;border:1px solid var(--eb-line-soft);border-radius:8px;background:var(--eb-soft);color:var(--eb-muted);font-size:13px}.manual-grid{display:grid;grid-template-columns:repeat(2,minmax(0,1fr));gap:9px}.manual-zone{display:grid;grid-template-columns:minmax(0,1fr) 100px auto;gap:8px;align-items:center;padding:10px 11px;border:1px solid var(--eb-line-soft);border-radius:8px;background:var(--eb-soft)}.manual-zone label{margin:0;overflow-wrap:anywhere}.manual-zone input{width:100%;max-width:none;min-height:38px;margin:0}.manual-zone span{color:var(--eb-muted);font-weight:650}.manual-summary{margin-top:12px;padding:11px 13px;border:1px solid #cbdde5;border-radius:8px;background:var(--eb-info-soft)}.manual-summary b,.manual-summary span{display:block}.manual-summary span{margin-top:3px;color:var(--eb-muted);font-size:12px}.manual-modal .actions{margin-top:14px}
@media(max-width:760px){.home-hero,.home-grid{grid-template-columns:1fr}.home-hero{padding:16px}.home-hero h1{font-size:21px}.home-hero-side{align-items:stretch;flex-direction:column;gap:14px}.home-clock,.home-clock.has-warning{width:100%}.home-hero .btnlink{width:100%}.home-card{min-height:0;padding:15px}.home-fact{grid-template-columns:1fr;gap:2px}.manual-modal{width:calc(100vw - 20px);padding:14px!important}.manual-template-list,.manual-grid{grid-template-columns:1fr}.manual-zone{grid-template-columns:minmax(0,1fr) 86px auto}.manual-modal .actions{display:grid;grid-template-columns:1fr 1fr}.manual-modal .actions button,.manual-modal .actions input{width:100%;margin:0}}
</style>)HTML");
    const AutomaticWateringState automatic = g_app->automaticWateringState();
    const Esp32BaseTime::Snapshot now = Esp32BaseTime::snapshot();
    const WateringScheduler::TimeState schedulerTime = g_app->schedulerTimeState();
    const bool timeTrusted = now.synced && schedulerTime == WateringScheduler::TimeState::Ready;
    const bool storageFault = g_app->recordStorageFault() || g_app->eventStorageFault() ||
                              g_app->schedulerStorageFault() || g_app->checkpointStorageFault();
    const IrrigationEvents::ConditionDisplayState rtcCondition =
        g_app->eventConditionState(1);
    const bool rtcUnavailable =
        rtcCondition == IrrigationEvents::ConditionDisplayState::Active ||
        rtcCondition == IrrigationEvents::ConditionDisplayState::ConfirmingRecovery;
    const IrrigationConfig* config = g_app->configuration();
    bool hasEnabledZone = false;
    if (config) {
        for (const ZoneConfig& zone : config->zones) {
            if (zone.enabled) hasEnabledZone = true;
        }
    }
    const NextAutomaticWatering next = g_app->nextAutomaticWatering();
    LatestRecordContext latest;
    if (!g_app->recordStorageFault()) {
        g_app->readLatestWateringRecords(0, 1, collectLatestRecord, &latest);
    }
    char value[96]{};
    char secondary[96]{};

    char result[12]{};
    if (getParam("result", result, sizeof(result))) {
        if (std::strcmp(result, "ok") == 0) {
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "操作已完成");
        } else if (std::strcmp(result, "error") == 0) {
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER, "操作失败",
                                     "请检查设备时间和当前状态后重试。");
        }
    }

    const char* heroTone = "";
    const char* heroEyebrow = "当前状态";
    const char* heroTitle = "当前没有浇水";
    const char* heroDescription = "自动计划会按设定时间运行，也可以随时手动开始。";
    const char* heroHref = nullptr;
    const char* heroAction = "手动浇水";
    if (!hasEnabledZone) {
        heroDescription = "请先启用实际安装的水路，再开始浇水或配置计划。";
        heroHref = "/irrigation/zones";
        heroAction = "设置水路";
    }
    if (!g_app->businessReady()) {
        heroTone = " danger";
        const IrrigationConfigStore::LoadResult loadResult =
            g_app->configurationLoadResult();
        if (loadResult == IrrigationConfigStore::LoadResult::StorageUnavailable) {
            heroTitle = "设备存储不可用";
            heroDescription = "新设备首次烧录后可能需要初始化文件系统。全部输出已保持关闭。确认设备中没有需要保留的数据后，请到系统工具格式化 LittleFS；如果设备此前已经使用过，请勿直接格式化。";
        } else if (loadResult == IrrigationConfigStore::LoadResult::InvalidConfig) {
            heroTitle = "灌溉配置需要重新建立";
            heroDescription = "当前配置结构不兼容或配置文件没有有效副本，全部输出已保持关闭。如需保留现有数据，请勿直接格式化；完成备份后再到系统工具格式化 LittleFS 并重新配置。";
        } else if (loadResult == IrrigationConfigStore::LoadResult::WriteFailed) {
            heroTitle = "灌溉配置无法保存";
            heroDescription = "文件系统可以读取，但配置写入或校验失败，全部输出已保持关闭。请先查看系统状态和日志，不要直接格式化。";
        } else {
            heroTitle = "灌溉功能未就绪";
            heroDescription = "启动检查未能完成，全部输出已保持关闭。请查看系统状态和日志，不要直接格式化。";
        }
        heroHref = "/esp32base/system";
        heroAction = "打开系统工具";
    } else if (g_app->schedulerStorageFault()) {
        heroTone = " danger";
        heroTitle = "自动浇水暂不可用";
        heroDescription = "调度状态无法可靠保存；手动浇水仍可使用。";
        heroHref = "/esp32base";
        heroAction = "查看系统状态";
    } else if (schedulerTime == WateringScheduler::TimeState::RtcRollback) {
        heroTone = " warn";
        heroTitle = "设备时间异常，自动浇水已停止";
        heroDescription = "检测到 RTC 时间明显倒退，等待 NTP 校时后自动恢复判断。";
        heroHref = "/esp32base";
        heroAction = "查看时间状态";
    } else if (!timeTrusted) {
        heroTone = " warn";
        heroTitle = "设备时间尚未就绪";
        heroDescription = "自动计划暂时不会运行，手动浇水仍可使用。";
        heroHref = "/esp32base";
        heroAction = "查看时间状态";
    } else if (storageFault) {
        heroTone = " warn";
        heroTitle = "设备可以浇水，但部分数据存储异常";
        heroDescription = "请查看系统状态；自动计划或历史记录可能受到影响。";
        heroHref = "/esp32base";
        heroAction = "查看系统状态";
    }
    const char* defaultHeroTone = heroTone;
    const char* defaultHeroTitle = heroTitle;
    const char* defaultHeroDescription = heroDescription;
    const char* defaultHeroHref = heroHref;
    const char* defaultHeroAction = heroAction;
    const bool flowAlarm = g_app->businessReady() && g_app->unexpectedFlowAlarm();
    if (flowAlarm) {
        heroTone = " danger";
        heroTitle = "关阀后水流异常";
        heroDescription = "水泵和全部阀门均已关闭，但仍检测到水流。请检查阀门、管路或流量计。";
    }
    Esp32BaseWeb::sendChunk("<section class='home-hero");
    Esp32BaseWeb::sendChunk(heroTone);
    Esp32BaseWeb::sendChunk("' id='home-hero' data-default-tone='");
    Esp32BaseWeb::writeHtmlEscaped(defaultHeroTone);
    Esp32BaseWeb::sendChunk("' data-default-title='");
    Esp32BaseWeb::writeHtmlEscaped(defaultHeroTitle);
    Esp32BaseWeb::sendChunk("' data-default-description='");
    Esp32BaseWeb::writeHtmlEscaped(defaultHeroDescription);
    Esp32BaseWeb::sendChunk("' data-rtc-unavailable='");
    Esp32BaseWeb::sendChunk(rtcUnavailable ? "1" : "0");
    Esp32BaseWeb::sendChunk("'><div><span class='home-eyebrow'>");
    Esp32BaseWeb::writeHtmlEscaped(heroEyebrow);
    Esp32BaseWeb::sendChunk("</span><h1 id='home-hero-title'>");
    Esp32BaseWeb::writeHtmlEscaped(heroTitle);
    Esp32BaseWeb::sendChunk("</h1><p id='home-hero-description'>");
    Esp32BaseWeb::writeHtmlEscaped(heroDescription);
    if (watering.active) {
        Esp32BaseWeb::sendChunk(" · ");
        Esp32BaseWeb::writeHtmlEscaped(wateringStateName(watering.state));
        Esp32BaseWeb::sendChunk(watering.flowEstablished ? " · 水流正常" : " · 正在等待水流");
    }
    Esp32BaseWeb::sendChunk("</p><span id='home-flow-monitor' class='home-monitor");
    if (flowAlarm) Esp32BaseWeb::sendChunk(" danger");
    Esp32BaseWeb::sendChunk("'>");
    if (flowAlarm) {
        const uint16_t observedSec =
            g_app->unexpectedFlowObservedWindowSec();
        const uint32_t pulseCount =
            g_app->unexpectedFlowObservedPulseCount();
        char estimatedFlow[20]{};
        IrrigationConfigRules::formatLitersPerMinute(
            g_app->unexpectedFlowEstimatedMlPerMinute(),
            estimatedFlow,
            sizeof(estimatedFlow));
        Esp32BaseWeb::sendChunk("近 ");
        sendUnsigned(observedSec == 0 ? 1 : observedSec);
        Esp32BaseWeb::sendChunk(" 秒检测到 ");
        sendUnsigned(pulseCount);
        Esp32BaseWeb::sendChunk(" 个水流脉冲 · 估算平均流量 ");
        Esp32BaseWeb::writeHtmlEscaped(estimatedFlow);
        Esp32BaseWeb::sendChunk(" L/min");
    } else if (g_app->unexpectedFlowObservationReady()) {
        Esp32BaseWeb::sendChunk("关阀后水流监测已开启");
    } else {
        Esp32BaseWeb::sendChunk("关阀后水流监测中");
    }
    Esp32BaseWeb::sendChunk("</span></div><div class='home-hero-side'><div id='home-clock' class='home-clock");
    if (!timeTrusted) Esp32BaseWeb::sendChunk(" pending");
    if (rtcUnavailable) Esp32BaseWeb::sendChunk(" has-warning");
    Esp32BaseWeb::sendChunk("'");
    if (timeTrusted) {
        Esp32BaseWeb::sendChunk(" data-epoch='");
        sendUnsigned(now.epochSec);
        Esp32BaseWeb::sendChunk("'");
    }
    Esp32BaseWeb::sendChunk("><b id='home-clock-time' class='home-clock-time'>");
    if (timeTrusted && Esp32BaseTime::formatEpoch(now.epochSec, value, sizeof(value), "%H:%M:%S")) {
        Esp32BaseWeb::writeHtmlEscaped(value);
    } else {
        Esp32BaseWeb::sendChunk("尚未就绪");
    }
    Esp32BaseWeb::sendChunk("</b><span class='home-clock-date'><span id='home-clock-date'>");
    if (timeTrusted && formatChineseDate(now.epochSec, value, sizeof(value))) {
        Esp32BaseWeb::writeHtmlEscaped(value);
        Esp32BaseWeb::sendChunk("</span>");
        Esp32BaseWeb::sendChunk(now.source == Esp32BaseTime::SOURCE_NTP ? " · NTP 校时" : " · RTC 时间");
    } else {
        Esp32BaseWeb::sendChunk("等待 RTC 或 NTP 提供可信时间");
        Esp32BaseWeb::sendChunk("</span>");
    }
    Esp32BaseWeb::sendChunk("</span>");
    if (rtcUnavailable) {
        Esp32BaseWeb::sendChunk("<a class='home-clock-warning' href='/irrigation/events'>硬件时钟不可用 · 断网后计划可能暂停</a>");
    }
    Esp32BaseWeb::sendChunk("</div>");
    Esp32BaseWeb::sendChunk("<span id='home-default-action' class='home-action");
    if (flowAlarm) Esp32BaseWeb::sendChunk(" hidden");
    Esp32BaseWeb::sendChunk("'>");
    if (defaultHeroHref) {
        Esp32BaseWeb::sendChunk("<a class='btnlink info' href='");
        Esp32BaseWeb::writeHtmlEscaped(defaultHeroHref);
        Esp32BaseWeb::sendChunk("'>");
        Esp32BaseWeb::writeHtmlEscaped(defaultHeroAction);
        Esp32BaseWeb::sendChunk("</a>");
    } else if (config && hasEnabledZone) {
        Esp32BaseWeb::sendChunk("<button type='button' class='btnlink info' onclick=\"document.getElementById('manual-watering').showModal()\">");
        Esp32BaseWeb::writeHtmlEscaped(defaultHeroAction);
        Esp32BaseWeb::sendChunk("</button>");
    }
    Esp32BaseWeb::sendChunk("</span><a id='home-alarm-action' class='home-action btnlink info");
    if (!flowAlarm) Esp32BaseWeb::sendChunk(" hidden");
    Esp32BaseWeb::sendChunk("' href='/irrigation/events'>查看事件</a></div></section>");
    const bool heroShowsOtherPriority = watering.active || g_app->unexpectedFlowAlarm();
    if (heroShowsOtherPriority && g_app->schedulerStorageFault()) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER, "自动浇水暂不可用",
                                 "调度状态无法可靠保存；当前或手动浇水不受影响。");
    } else if (heroShowsOtherPriority && schedulerTime == WateringScheduler::TimeState::RtcRollback) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "设备时间异常",
                                 "自动计划已停止，等待 NTP 校时后恢复判断。");
    } else if (heroShowsOtherPriority && !timeTrusted) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "设备时间尚未就绪",
                                 "自动计划暂时不会运行，手动浇水仍可使用。");
    }
    if (heroShowsOtherPriority && storageFault && !g_app->schedulerStorageFault()) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "部分数据存储异常",
                                 "请在当前浇水结束后查看系统状态。");
    }
    Esp32BaseWeb::sendChunk("<div class='home-grid'>");

    Esp32BaseWeb::sendChunk("<section class='home-card'><div class='home-card-head'><h2>下一次自动浇水</h2>");
    if (automatic.mode == AutomaticWateringMode::Enabled) {
        Esp32BaseWeb::sendChunk("<span class='tag ok'>自动浇水正常</span></div>");
    } else {
        Esp32BaseWeb::sendChunk("<span class='tag warn'>自动浇水已暂停</span></div>");
    }
    if (automatic.mode == AutomaticWateringMode::PausedIndefinitely) {
        Esp32BaseWeb::sendChunk("<div class='home-main'>等待你手动恢复</div><p class='home-sub'>暂停期间到点的计划不会执行，也不会补执行。</p>");
    } else {
        if (automatic.mode == AutomaticWateringMode::PausedUntil) {
            if (formatFriendlyDateTime(automatic.resumeAtEpoch, now.epochSec, value, sizeof(value)) &&
                formatFullDateTime(automatic.resumeAtEpoch, secondary, sizeof(secondary))) {
                Esp32BaseWeb::sendChunk("<div class='home-main'>将在");
                Esp32BaseWeb::writeHtmlEscaped(value);
                Esp32BaseWeb::sendChunk("自动恢复</div><p class='home-sub'>");
                Esp32BaseWeb::writeHtmlEscaped(secondary);
                if (!timeTrusted) Esp32BaseWeb::sendChunk("；设备时间恢复可信后才会判断是否到期");
                Esp32BaseWeb::sendChunk("</p>");
            }
        }
        if (next.status == NextAutomaticWateringStatus::Available &&
            formatFriendlyDateTime(next.scheduledEpoch, now.epochSec, value, sizeof(value)) &&
            formatFullDateTime(next.scheduledEpoch, secondary, sizeof(secondary))) {
            const WateringPlan* nextPlan =
                config && next.planId != 0 && next.planId <= config->plans.size()
                    ? &config->plans[next.planId - 1U]
                    : nullptr;
            if (automatic.mode == AutomaticWateringMode::Enabled) {
                Esp32BaseWeb::sendChunk("<div class='home-main'>");
                Esp32BaseWeb::writeHtmlEscaped(value);
                Esp32BaseWeb::sendChunk("</div><p class='home-sub'>");
                Esp32BaseWeb::writeHtmlEscaped(secondary);
                Esp32BaseWeb::sendChunk("</p>");
            }
            Esp32BaseWeb::sendChunk("<div class='home-plan'><span>");
            Esp32BaseWeb::sendChunk(automatic.mode == AutomaticWateringMode::Enabled ? "执行计划" : "恢复后的计划");
            Esp32BaseWeb::sendChunk("</span><b>");
            const char* nextPlanName = planNameById(config, next.planId);
            if (nextPlanName) {
                Esp32BaseWeb::writeHtmlEscaped(nextPlanName);
            } else {
                Esp32BaseWeb::sendChunk("计划 ");
                sendUnsigned(next.planId);
            }
            Esp32BaseWeb::sendChunk("</b></div>");
            uint8_t nextZoneCount = 0;
            uint32_t nextTotalMinutes = 0;
            if (nextPlan) {
                for (uint8_t index = 0;
                     index < nextPlan->zoneDurationMinutes.size();
                     ++index) {
                    if (!config->zones[index].enabled ||
                        nextPlan->zoneDurationMinutes[index] == 0) {
                        continue;
                    }
                    ++nextZoneCount;
                    nextTotalMinutes += nextPlan->zoneDurationMinutes[index];
                }
            }
            Esp32BaseWeb::sendChunk("<div class='home-facts'><div class='home-fact'><span>执行内容</span><b>");
            sendUnsigned(nextZoneCount);
            Esp32BaseWeb::sendChunk(" 个水路 · 预计 ");
            sendUnsigned(nextTotalMinutes);
            Esp32BaseWeb::sendChunk(" 分钟</b></div>");
            if (nextPlan && nextZoneCount != 0) {
                Esp32BaseWeb::sendChunk("<div class='home-fact'><span>水路安排</span><b>");
                uint8_t emitted = 0;
                for (uint8_t index = 0;
                     index < nextPlan->zoneDurationMinutes.size() && emitted < 3;
                     ++index) {
                    const uint16_t duration =
                        nextPlan->zoneDurationMinutes[index];
                    if (!config->zones[index].enabled || duration == 0) continue;
                    if (emitted != 0) Esp32BaseWeb::sendChunk(" · ");
                    Esp32BaseWeb::writeHtmlEscaped(
                        config->zones[index].name.data());
                    Esp32BaseWeb::sendChunk(" ");
                    sendUnsigned(duration);
                    Esp32BaseWeb::sendChunk(" 分");
                    ++emitted;
                }
                if (nextZoneCount > emitted) {
                    Esp32BaseWeb::sendChunk(" · 另有 ");
                    sendUnsigned(nextZoneCount - emitted);
                    Esp32BaseWeb::sendChunk(" 个水路");
                }
                Esp32BaseWeb::sendChunk("</b></div>");
            }
            if (automatic.mode == AutomaticWateringMode::PausedUntil) {
                Esp32BaseWeb::sendChunk("<div class='home-fact'><span>下一次执行</span><b>");
                Esp32BaseWeb::writeHtmlEscaped(value);
                Esp32BaseWeb::sendChunk("</b></div>");
            }
            Esp32BaseWeb::sendChunk("</div>");
        } else if (next.status == NextAutomaticWateringStatus::NoEnabledPlans) {
            Esp32BaseWeb::sendChunk("<div class='home-empty'>还没有开启自动执行的计划。设置计划和启动时间后，下一次浇水会显示在这里。</div>");
        } else if (next.status == NextAutomaticWateringStatus::RtcRollback) {
            Esp32BaseWeb::sendChunk("<div class='home-empty'>设备时间发生倒退，暂时无法计算下一次浇水。</div>");
        } else if (next.status == NextAutomaticWateringStatus::TimeUnavailable) {
            Esp32BaseWeb::sendChunk("<div class='home-empty'>设备时间尚未就绪，暂时无法计算下一次浇水。</div>");
        }
    }
    Esp32BaseWeb::sendChunk("<div class='home-card-actions'><a class='btnlink secondary' href='/irrigation/plans'>管理计划</a></div></section>");

