tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
    Esp32BaseWeb::sendChunk("<section id='home-recent-card' class='home-card");
    if (latest.found) {
        Esp32BaseWeb::sendChunk(" ");
        Esp32BaseWeb::sendChunk(recordOutcomeTone(latest.record.payload));
    }
    Esp32BaseWeb::sendChunk("'><div class='home-card-head'><h2>最近一次浇水</h2>");
    if (latest.found) {
        Esp32BaseWeb::sendChunk("<span class='tag ");
        Esp32BaseWeb::sendChunk(recordOutcomeTone(latest.record.payload));
        Esp32BaseWeb::sendChunk("'>");
        Esp32BaseWeb::sendChunk(recordOutcomeName(latest.record.payload));
        Esp32BaseWeb::sendChunk("</span>");
    } else {
        Esp32BaseWeb::sendChunk("<a class='btnlink compact secondary' href='/irrigation/records'>全部记录</a>");
    }
    Esp32BaseWeb::sendChunk("</div>");
    if (g_app->recordStorageFault()) {
        Esp32BaseWeb::sendChunk("<div class='home-empty'>浇水记录存储异常，暂时无法读取最近记录。</div>");
    } else if (!latest.found) {
        Esp32BaseWeb::sendChunk("<div class='home-empty'>还没有浇水记录。第一次浇水执行结束后，无论完成、停止或失败，结果都会显示在这里。</div>");
    } else {
        const WateringRecordTotals totals = WateringRecordCodec::calculateTotals(
            latest.record.payload);
        Esp32BaseWeb::sendChunk("<div class='home-main'>");
        Esp32BaseWeb::writeHtmlEscaped(sourceName(latest.record.payload.source));
        const char* recordPlanName = planNameById(config, latest.record.payload.planId);
        if (recordPlanName) {
            Esp32BaseWeb::sendChunk(" · ");
            Esp32BaseWeb::writeHtmlEscaped(recordPlanName);
        }
        Esp32BaseWeb::sendChunk("</div><p class='home-sub'>");
        sendRecordTimeRange(latest.record.timing);
        Esp32BaseWeb::sendChunk("</p><p class='home-outcome'>");
        sendRecordOutcomeSummary(latest.record.payload, config);
        Esp32BaseWeb::sendChunk("</p><div class='home-facts'><div class='home-fact'><span>计划浇水</span><b>");
        formatElapsed(totals.plannedDurationSec, value, sizeof(value));
        Esp32BaseWeb::writeHtmlEscaped(value);
        Esp32BaseWeb::sendChunk("</b></div><div class='home-fact'><span>实际浇水</span><b>");
        formatElapsed(totals.actualWateringSec, value, sizeof(value));
        Esp32BaseWeb::writeHtmlEscaped(value);
        Esp32BaseWeb::sendChunk("</b></div><div class='home-fact'><span>估算用水量</span><b>");
        sendCompactWaterVolume(totals.estimatedWaterMl);
        Esp32BaseWeb::sendChunk("</b></div></div><div class='home-card-actions'><a class='btnlink info' href='/irrigation/records?id=");
        sendUnsigned(latest.record.recordId);
        Esp32BaseWeb::sendChunk("'>查看完整记录</a><a class='btnlink secondary' href='/irrigation/records'>全部记录</a></div>");
    }
    Esp32BaseWeb::sendChunk("</section></div>");

    const uint32_t checkpointEpoch = g_app->lastKnownAliveEpoch();
    const char* resetReason = Esp32BaseSystem::resetReason();
    if (now.synced && checkpointEpoch != 0 && now.bootStartEpochSec >= checkpointEpoch &&
        (std::strcmp(resetReason, "poweron") == 0 ||
         std::strcmp(resetReason, "brownout") == 0)) {
        char checkpointText[24]{};
        char bootText[24]{};
        char message[96]{};
        if (Esp32BaseTime::formatEpoch(checkpointEpoch, checkpointText,
                                       sizeof(checkpointText), "%Y-%m-%d %H:%M") &&
            Esp32BaseTime::formatEpoch(now.bootStartEpochSec, bootText,
                                       sizeof(bootText), "%Y-%m-%d %H:%M")) {
            std::snprintf(message, sizeof(message), "%s 至 %s；仅为可能范围，不是精确停电时间",
                          checkpointText, bootText);
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "可能断电范围", message);
        }
    }
    if (config && hasEnabledZone) {
        Esp32BaseWeb::sendChunk("<dialog id='manual-watering' class='panel eb-modal manual-modal' data-eb-light-dismiss='1'><h2>手动浇水</h2><p class='muted'>可以从计划填入时长，也可以直接设置；最终只按这里提交的时长执行，不会修改计划。</p><form id='manual-form' method='post' action='/irrigation' onsubmit='return submitManualWatering(this)'><input type='hidden' name='action' value='start_zones'>");
        bool hasPlan = false;
        for (const WateringPlan& plan : config->plans) if (plan.configured) hasPlan = true;
        Esp32BaseWeb::sendChunk("<div class='manual-template'><div class='manual-template-head'><h3>快速填入计划</h3><a href='/irrigation/plans'>管理计划</a></div>");
        if (hasPlan) {
            Esp32BaseWeb::sendChunk("<div class='manual-template-list'>");
            for (const WateringPlan& plan : config->plans) {
                if (!plan.configured) continue;
                uint16_t activeZoneCount = 0;
                uint32_t totalMinutes = 0;
                for (uint8_t index = 0; index < plan.zoneDurationMinutes.size(); ++index) {
                    if (!config->zones[index].enabled || plan.zoneDurationMinutes[index] == 0) continue;
                    ++activeZoneCount;
                    totalMinutes += plan.zoneDurationMinutes[index];
                }
                Esp32BaseWeb::sendChunk("<button type='button' class='manual-template-card' data-plan-name='");
                Esp32BaseWeb::writeHtmlEscaped(plan.name.data());
                Esp32BaseWeb::sendChunk("' data-durations='");
                for (uint8_t index = 0; index < plan.zoneDurationMinutes.size(); ++index) {
                    if (index != 0) Esp32BaseWeb::sendChunk(",");
                    sendUnsigned(plan.zoneDurationMinutes[index]);
                }
                Esp32BaseWeb::sendChunk("'");
                if (activeZoneCount == 0) Esp32BaseWeb::sendChunk(" disabled");
                Esp32BaseWeb::sendChunk("><b>");
                Esp32BaseWeb::writeHtmlEscaped(plan.name.data());
                Esp32BaseWeb::sendChunk("</b><span>");
                bool emittedZone = false;
                for (uint8_t index = 0; index < plan.zoneDurationMinutes.size(); ++index) {
                    if (!config->zones[index].enabled || plan.zoneDurationMinutes[index] == 0) continue;
                    if (emittedZone) Esp32BaseWeb::sendChunk(" · ");
                    Esp32BaseWeb::writeHtmlEscaped(config->zones[index].name.data());
                    Esp32BaseWeb::sendChunk(" ");
                    sendUnsigned(plan.zoneDurationMinutes[index]);
                    Esp32BaseWeb::sendChunk("分");
                    emittedZone = true;
                }
                if (!emittedZone) Esp32BaseWeb::sendChunk("当前无可执行水路");
                Esp32BaseWeb::sendChunk("</span><small>");
                sendUnsigned(activeZoneCount);
                Esp32BaseWeb::sendChunk(" 路 · 共 ");
                sendUnsigned(totalMinutes);
                Esp32BaseWeb::sendChunk(" 分钟</small></button>");
            }
            Esp32BaseWeb::sendChunk("</div>");
        } else {
            Esp32BaseWeb::sendChunk("<div class='manual-template-empty'>还没有可用计划，可以直接设置下方各水路时长。</div>");
        }
        Esp32BaseWeb::sendChunk("</div>");
        Esp32BaseWeb::sendChunk("<div class='manual-grid'>");
        for (uint8_t index = 0; index < config->zones.size(); ++index) {
            if (!config->zones[index].enabled) continue;
            Esp32BaseWeb::sendChunk("<div class='manual-zone'><label>");
            Esp32BaseWeb::writeHtmlEscaped(config->zones[index].name.data());
            Esp32BaseWeb::sendChunk("</label><input class='manual-duration' data-zone-index='"); sendUnsigned(index);
            Esp32BaseWeb::sendChunk("' type='number' min='0' max='120' name='zone"); sendUnsigned(index + 1U);
            Esp32BaseWeb::sendChunk("' value='0' inputmode='numeric'><span>分钟</span></div>");
        }
        Esp32BaseWeb::sendChunk("</div><div class='manual-summary'><b id='manual-summary'>尚未选择水路</b><span id='manual-template-note'>每条水路范围 0～120 分钟，0 表示本次不执行。</span></div><div class='actions'><button id='manual-clear' type='button' class='secondary'>全部清零</button><button type='button' class='secondary' onclick='this.closest(\"dialog\").close()'>取消</button><input id='manual-submit' type='submit' value='确认并开始浇水' disabled></div></form></dialog>");
    } else if (config) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "还没有启用水路", "请先到水路页面启用实际安装的水路。");
        Esp32BaseWeb::sendChunk("<div class='actions'><a class='btnlink info' href='/irrigation/zones'>前往水路设置</a></div>");
    }
    Esp32BaseWeb::sendChunk(R"HTML(<script>(function(){
var recentCard=document.getElementById('home-recent-card');try{if(recentCard&&sessionStorage.getItem('irrigationJustFinished')==='1'){sessionStorage.removeItem('irrigationJustFinished');recentCard.classList.add('just-finished');setTimeout(function(){recentCard.classList.remove('just-finished')},3600)}}catch(ignore){}
var clock=document.getElementById('home-clock'),clockTime=document.getElementById('home-clock-time'),clockDate=document.getElementById('home-clock-date');if(clock&&clock.dataset.epoch){var clockBase=Number(clock.dataset.epoch),clockStarted=performance.now();function clockPad(v){return String(v).padStart(2,'0')}function updateClock(){var epoch=clockBase+Math.floor((performance.now()-clockStarted)/1000),d=new Date((epoch+28800)*1000);if(clockTime)clockTime.textContent=clockPad(d.getUTCHours())+':'+clockPad(d.getUTCMinutes())+':'+clockPad(d.getUTCSeconds());if(clockDate)clockDate.textContent=d.getUTCFullYear()+'年'+(d.getUTCMonth()+1)+'月'+d.getUTCDate()+'日'}updateClock();setInterval(updateClock,1000)}
var inputs=Array.prototype.slice.call(document.querySelectorAll('.manual-duration')),submit=document.getElementById('manual-submit'),summary=document.getElementById('manual-summary'),note=document.getElementById('manual-template-note'),cards=Array.prototype.slice.call(document.querySelectorAll('.manual-template-card')),applyingTemplate=false,count=0,total=0;
function update(){count=0;total=0;inputs.forEach(function(input){var value=Math.max(0,Math.min(120,Number(input.value)||0));if(value>0){count++;total+=value}});if(summary)summary.textContent=count?('已选择 '+count+' 条水路 · 合计 '+total+' 分钟'):'尚未选择水路';if(submit)submit.disabled=count===0}
inputs.forEach(function(input){input.addEventListener('input',function(){update();if(applyingTemplate)return;cards.forEach(function(card){card.classList.remove('selected')});if(note)note.textContent='当前时长已手动调整，不会修改任何计划。'})});
cards.forEach(function(card){card.addEventListener('click',function(){if(card.disabled)return;var values=(card.dataset.durations||'').split(',');applyingTemplate=true;inputs.forEach(function(input){input.value=values[Number(input.dataset.zoneIndex)]||0});applyingTemplate=false;cards.forEach(function(item){item.classList.toggle('selected',item===card)});if(note)note.textContent='已从“'+(card.dataset.planName||'计划')+'”填入，可继续修改；本次修改不会保存到计划。';update()})});
var clear=document.getElementById('manual-clear');if(clear)clear.addEventListener('click',function(){inputs.forEach(function(input){input.value=0});cards.forEach(function(card){card.classList.remove('selected')});if(note)note.textContent='已全部清零。';update()});
window.submitManualWatering=function(form){update();if(!count){alert('请至少为一条水路设置大于 0 的时长。');return false}return confirm('确认手动浇水 '+count+' 条水路，合计 '+total+' 分钟？')&&once(form)};update();
var hero=document.getElementById('home-hero'),heroTitle=document.getElementById('home-hero-title'),heroDescription=document.getElementById('home-hero-description'),monitor=document.getElementById('home-flow-monitor'),defaultAction=document.getElementById('home-default-action'),alarmAction=document.getElementById('home-alarm-action');
function toggleHidden(element,hidden){if(element)element.classList.toggle('hidden',hidden)}
function alarmObservation(status){var seconds=Math.max(1,Number(status.unexpectedFlowObservedWindowSec)||1),pulses=Number(status.unexpectedFlowPulseCount)||0,flow=(Number(status.unexpectedFlowEstimatedMlPerMinute)||0)/1000;return'近 '+seconds+' 秒检测到 '+pulses+' 个水流脉冲 · 估算平均流量 '+flow.toFixed(3)+' L/min'}
function updateIdleStatus(status){if(status.active||!!status.rtcUnavailable!==(hero.dataset.rtcUnavailable==='1')){location.reload();return false}var alarm=!!status.unexpectedFlowAlarm;if(hero){var tone=alarm?'danger':String(hero.dataset.defaultTone||'').trim();hero.className='home-hero'+(tone?' '+tone:'')}if(heroTitle)heroTitle.textContent=alarm?'关阀后水流异常':hero.dataset.defaultTitle;if(heroDescription)heroDescription.textContent=alarm?'水泵和全部阀门均已关闭，但仍检测到水流。请检查阀门、管路或流量计。':hero.dataset.defaultDescription;toggleHidden(defaultAction,alarm);toggleHidden(alarmAction,!alarm);if(monitor){monitor.classList.toggle('danger',alarm);if(alarm)monitor.textContent=alarmObservation(status);else if(status.unexpectedFlowObservationReady)monitor.textContent='关阀后水流监测已开启';else monitor.textContent='关阀后水流监测中'}return true}
var pollTimer=0,polling=false;function schedulePoll(delay){clearTimeout(pollTimer);pollTimer=setTimeout(poll,delay)}function poll(){if(polling)return;polling=true;fetch('/irrigation/api/status',{cache:'no-store',credentials:'same-origin'}).then(function(response){return response.json()}).then(function(status){polling=false;if(updateIdleStatus(status))schedulePoll(document.hidden?15000:5000)}).catch(function(){polling=false;schedulePoll(document.hidden?15000:10000)})}
document.addEventListener('visibilitychange',function(){schedulePoll(document.hidden?15000:0)});schedulePoll(5000);
})();</script>)HTML");
    endPage();
}

