tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
void IrrigationWeb::zoneLearning() {
    uint32_t zoneId = 0;
    char zoneText[12]{};
    if (getParam("zone", zoneText, sizeof(zoneText))) parseUint(zoneText, 1, BoardPins::kZoneCount, zoneId);
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        if (!Esp32BaseWeb::checkPostAllowed("irrigation_zone_learning")) return;
        if (!uintParam("zone_id", 1, BoardPins::kZoneCount, zoneId)) {
            Esp32BaseWeb::sendText(400, "invalid_zone"); return;
        }
        const WateringStatus status = g_app->wateringStatus();
        bool success = false;
        if (actionIs("start")) success = g_app->startZoneFlowLearning(static_cast<uint8_t>(zoneId)) == WateringStartResult::Started;
        else if (actionIs("stop")) success = status.active && status.purpose == WateringPurpose::ZoneFlowLearning && status.activeZoneId == zoneId && g_app->stopWatering();
        else if (actionIs("save")) { uint32_t revision = 0; success = uintParam("revision", 1, UINT32_MAX, revision) && g_app->pendingLearnedZoneId() == zoneId && g_app->saveLearnedZoneFlow(revision); }
        else if (actionIs("discard")) { success = g_app->pendingLearnedZoneId() == zoneId; if (success) g_app->discardLearnedZoneFlow(); }
        else if (actionIs("manual")) {
            char flowText[20]{};
            uint32_t flowMlPerMinute = 0;
            uint32_t revision = 0;
            success = getParam("baseline_flow", flowText, sizeof(flowText)) &&
                      IrrigationConfigRules::parseLitersPerMinute(
                          flowText, flowMlPerMinute) &&
                      flowMlPerMinute != 0 &&
                      uintParam("revision", 1, UINT32_MAX, revision) &&
                      g_app->saveManualZoneBaselineFlow(
                          static_cast<uint8_t>(zoneId),
                          flowMlPerMinute,
                          revision);
        }
        else if (actionIs("clear")) { uint32_t revision = 0; success = uintParam("revision", 1, UINT32_MAX, revision) && g_app->clearLearnedZoneFlow(static_cast<uint8_t>(zoneId), revision); }
        char location[96]{};
        std::snprintf(location, sizeof(location), "/irrigation/zones/learning?zone=%lu&result=%s", static_cast<unsigned long>(zoneId), success ? "ok" : "error");
        Esp32BaseWeb::redirectSeeOther(location);
        return;
    }
    if (!beginPage("基准流量学习", "等待流量稳定后生成该水路的基准流量")) return;
    const IrrigationConfig* config = g_app->configuration();
    if (!config || zoneId == 0) { Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER, "水路参数无效"); endPage(); return; }
    const ZoneConfig& zone = config->zones[zoneId - 1U];
    const WateringStatus status = g_app->wateringStatus();
    const bool active = status.active && status.purpose == WateringPurpose::ZoneFlowLearning && status.activeZoneId == zoneId;
    uint32_t learnedFlowMlPerMinute = 0;
    FlowMonitor::pulseRateX10000ToFlowMlPerMinute(
        zone.baselinePulseRateX10000,
        config->flowMeter.pulsesPerLiterX100,
        learnedFlowMlPerMinute);
    char learned[20]{};
    IrrigationConfigRules::formatLitersPerMinute(
        learnedFlowMlPerMinute, learned, sizeof(learned));
    char learnedWithUnit[32]{};
    std::snprintf(learnedWithUnit, sizeof(learnedWithUnit), "%s L/min", learned);
    char learnedRate[20]{};
    formatTenThousandths(
        zone.baselinePulseRateX10000, learnedRate, sizeof(learnedRate));
    const bool baselineManagementAvailable =
        !status.active && g_app->pendingLearnedZoneId() == 0;
    Esp32BaseWeb::sendChunk(
        R"HTML(<style>
.learning-panel{padding-bottom:16px}.learning-context{display:grid;grid-template-columns:repeat(3,minmax(0,1fr));gap:0;margin:-2px 0 14px;border:1px solid var(--eb-line-soft);border-radius:9px;background:var(--eb-soft)}.learning-context>div{min-width:0;padding:10px 12px;border-right:1px solid var(--eb-line-soft)}.learning-context>div:last-child{border-right:0}.learning-label{display:block;color:var(--eb-muted);font-size:11px;font-weight:400}.learning-context-value{display:block;margin-top:2px;font-size:14px;font-weight:400;overflow-wrap:anywhere}.learning-context-help{display:block;margin-top:2px;color:var(--eb-muted);font-size:11px;font-weight:400}
.learning-head{display:flex;align-items:center;justify-content:space-between;gap:10px;margin:0 0 10px}.learning-head h3{margin:0;font-size:15px;font-weight:500}.learning-head .tag{font-weight:400}.learning-metrics{display:grid;grid-template-columns:repeat(4,minmax(0,1fr));gap:8px}.learning-metric{min-width:0;padding:10px 11px;border:1px solid var(--eb-line-soft);border-radius:8px;background:#fff}.learning-value{display:block;margin-top:3px;font-size:18px;font-weight:500;font-variant-numeric:tabular-nums;overflow-wrap:anywhere}.learning-rule{margin:10px 0 0;padding:9px 11px;border-radius:8px;background:var(--eb-soft);color:var(--eb-muted);font-size:12px;font-weight:400;line-height:1.55}.learning-rule span{color:var(--eb-text);font-weight:400}
.learning-debug{margin-top:14px}.learning-debug h3{margin:0 0 2px;font-size:14px;font-weight:500}.learning-debug>p{margin:0 0 7px;color:var(--eb-muted);font-size:11px}.learning-table{width:100%;border-collapse:collapse;font-size:12px;font-variant-numeric:tabular-nums}.learning-table th,.learning-table td{padding:7px 8px;border-bottom:1px solid var(--eb-line-soft);text-align:right;font-weight:400;white-space:nowrap}.learning-table th{color:var(--eb-muted);font-size:11px}.learning-table th:first-child,.learning-table td:first-child{text-align:left}.learning-table tbody tr:last-child td{border-bottom:0}.learning-table tr.learning-decision td{background:#f6faf8}.learning-table tr.learning-decision-start td{border-top:1px solid #cfe5da}.learning-inline{display:inline-flex;align-items:baseline;justify-content:flex-end;gap:7px}.learning-change{color:var(--eb-muted);font-size:10px;font-weight:400}.learning-latest{margin-left:5px;color:#16794a;font-size:10px;font-weight:400}.learning-table .learning-empty{text-align:center;color:var(--eb-muted);padding:12px}.learning-summary{display:flex;flex-wrap:wrap;gap:5px 18px;margin:8px 0 0;color:var(--eb-muted);font-size:11px}.learning-summary span{font-weight:400}.learning-result{display:grid;grid-template-columns:repeat(2,minmax(0,1fr));gap:8px;margin-bottom:10px}.learning-result>div{padding:11px;border:1px solid var(--eb-line-soft);border-radius:8px}.learning-result-value{display:block;margin-top:3px;font-size:18px;font-weight:500;font-variant-numeric:tabular-nums}.learning-actions{display:flex;flex-wrap:wrap;gap:8px;margin-top:12px}.learning-actions form,.learning-actions .actions{margin:0}.learning-panel input,.learning-panel .btnlink{font-weight:500}.learning-manual{width:min(520px,calc(100vw - 28px))}.learning-manual>p{margin-top:0}.learning-manual .field{margin:14px 0 0}.learning-manual input[type=number]{width:100%;margin-top:6px}.learning-manual-preview{display:flex;align-items:baseline;justify-content:space-between;gap:12px;margin-top:10px;padding:9px 11px;border-radius:8px;background:var(--eb-soft);color:var(--eb-muted);font-size:12px}.learning-manual-preview output{color:var(--eb-text);font-size:16px;font-variant-numeric:tabular-nums}
@media(max-width:760px){.learning-context{grid-template-columns:1fr 1fr}.learning-context>div{border-bottom:1px solid var(--eb-line-soft)}.learning-context>div:nth-child(2){border-right:0}.learning-context>div:last-child{grid-column:1/-1;border-bottom:0}.learning-metrics{grid-template-columns:repeat(2,minmax(0,1fr))}.learning-table{display:block}.learning-table thead{display:none}.learning-table tbody{display:grid;gap:7px}.learning-table tr{display:grid;grid-template-columns:repeat(2,minmax(0,1fr));padding:7px 9px;border:1px solid var(--eb-line-soft);border-radius:7px}.learning-table td{display:grid;grid-template-columns:6.8em minmax(0,1fr);gap:6px;padding:3px 0;border:0;text-align:right}.learning-table td::before{content:attr(data-label);color:var(--eb-muted);font-size:11px;text-align:left}.learning-table td:first-child{text-align:right}.learning-table .learning-empty{display:block;grid-column:1/-1;text-align:center}.learning-table .learning-empty::before{display:none}}
@media(max-width:420px){.learning-context,.learning-metrics,.learning-result{grid-template-columns:1fr}.learning-context>div{border-right:0}.learning-context>div:last-child{grid-column:auto}.learning-value,.learning-result-value{font-size:17px}.learning-table tr{grid-template-columns:1fr}}
</style>)HTML");
    Esp32BaseWeb::beginPanel("基准流量学习");
    Esp32BaseWeb::sendChunk("<div class='learning-panel'><div class='learning-context'><div><span class='learning-label'>水路</span><span class='learning-context-value'>");
    Esp32BaseWeb::writeHtmlEscaped(zone.name.data());
    Esp32BaseWeb::sendChunk("</span></div><div><span class='learning-label'>当前基准流量</span><span class='learning-context-value'>");
    Esp32BaseWeb::sendChunk(zone.baselinePulseRateX10000 == 0 ? "未设置" : learnedWithUnit);
    if (zone.baselinePulseRateX10000 != 0) {
        Esp32BaseWeb::sendChunk("</span><span class='learning-context-help'>原始脉冲基准：");
        Esp32BaseWeb::writeHtmlEscaped(learnedRate);
        Esp32BaseWeb::sendChunk(" P/s");
    }
    Esp32BaseWeb::sendChunk("</span></div><div><span class='learning-label'>安全上限</span><span class='learning-context-value'>10 分钟</span><span class='learning-context-help'>达到上限仍不稳定时自动停止</span></div></div>");
    if (!zone.enabled) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "这条水路尚未启用", "请先返回水路设置启用。");
    } else if (status.active && !active) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "设备正在执行其它任务");
    } else if (active) {
        char currentFlow[20]{};
        char averageFlow[20]{};
        IrrigationConfigRules::formatLitersPerMinute(
            status.currentFlowMlPerMinute, currentFlow, sizeof(currentFlow));
        IrrigationConfigRules::formatLitersPerMinute(
            status.learningAverageMlPerMinute, averageFlow, sizeof(averageFlow));
        Esp32BaseWeb::sendChunk("<div class='learning-head'><h3>学习状态</h3><span class='tag warn'>正在学习</span></div><div class='learning-metrics'><div class='learning-metric'><span class='learning-label'>已运行</span><span class='learning-value' id='learn-elapsed'>");
        sendDuration(status.elapsedSec);
        Esp32BaseWeb::sendChunk("</span></div><div class='learning-metric'><span class='learning-label'>最近 5 秒流量</span><span class='learning-value' id='learn-current'>");
        Esp32BaseWeb::writeHtmlEscaped(currentFlow);
        Esp32BaseWeb::sendChunk(" L/min</span></div><div class='learning-metric'><span class='learning-label'>已采集窗口平均</span><span class='learning-value' id='learn-average'>");
        Esp32BaseWeb::writeHtmlEscaped(averageFlow);
        Esp32BaseWeb::sendChunk(" L/min</span></div><div class='learning-metric'><span class='learning-label'>稳定判断</span><span class='learning-value' id='learn-state'>");
        if (status.learningTotalWindowCount < kLearningDecisionWindowCount) {
            Esp32BaseWeb::sendChunk("采集中 ");
            sendUnsigned(status.learningTotalWindowCount);
            Esp32BaseWeb::sendChunk("/5");
        } else {
            Esp32BaseWeb::sendChunk("波动偏大");
        }
        Esp32BaseWeb::sendChunk("</span></div></div><p class='learning-rule' id='learn-rule'>");
        if (status.learningWindowCount == 0) {
            Esp32BaseWeb::sendChunk("窗口 #1 正在采集；每个窗口约 5 秒且互不重叠。");
        } else {
            char minimumRate[20]{};
            char maximumRate[20]{};
            char spreadRate[20]{};
            char allowedRate[20]{};
            formatSignedHundredths(status.learningMinimumPulseRateX100,
                                   minimumRate, sizeof(minimumRate));
            formatSignedHundredths(status.learningMaximumPulseRateX100,
                                   maximumRate, sizeof(maximumRate));
            formatSignedHundredths(
                status.learningMaximumPulseRateX100 -
                    status.learningMinimumPulseRateX100,
                spreadRate, sizeof(spreadRate));
            formatSignedHundredths(status.learningAllowedPulseRateSpreadX100,
                                   allowedRate, sizeof(allowedRate));
            const uint32_t decisionFirst =
                status.learningTotalWindowCount >= kLearningDecisionWindowCount
                    ? status.learningTotalWindowCount -
                          kLearningDecisionWindowCount + 1U
                    : 1U;
            Esp32BaseWeb::sendChunk("已采集 <span>");
            sendUnsigned(status.learningTotalWindowCount);
            Esp32BaseWeb::sendChunk("</span> 个完整窗口，窗口 <span>#");
            sendUnsigned(status.learningTotalWindowCount + 1U);
            Esp32BaseWeb::sendChunk("</span> 正在采集；当前使用 <span>#");
            sendUnsigned(decisionFirst);
            Esp32BaseWeb::sendChunk("～#");
            sendUnsigned(status.learningTotalWindowCount);
            Esp32BaseWeb::sendChunk("</span> 判断。原始脉冲速率为 <span>");
            Esp32BaseWeb::writeHtmlEscaped(minimumRate);
            Esp32BaseWeb::sendChunk("～");
            Esp32BaseWeb::writeHtmlEscaped(maximumRate);
            Esp32BaseWeb::sendChunk(" P/s</span>，跨度 <span>");
            Esp32BaseWeb::writeHtmlEscaped(spreadRate);
            Esp32BaseWeb::sendChunk(" P/s</span>，允许 <span>");
            Esp32BaseWeb::writeHtmlEscaped(allowedRate);
            Esp32BaseWeb::sendChunk(" P/s</span>。收满 5 窗、每窗均有脉冲且跨度不超过允许值时完成。");
        }
        Esp32BaseWeb::sendChunk("</p>");
    } else if (g_app->pendingLearnedZoneId() == zoneId) {
        char suggestion[20]{};
        const bool validSuggestion = IrrigationConfigRules::formatLitersPerMinute(
            g_app->pendingLearnedFlowMlPerMinute(), suggestion, sizeof(suggestion));
        if (validSuggestion) {
            char baselineRate[20]{};
            formatTenThousandths(
                g_app->pendingLearnedBaselinePulseRateX10000(),
                baselineRate, sizeof(baselineRate));
            Esp32BaseWeb::sendChunk("<div class='learning-head'><h3>学习结果</h3><span class='tag ok'>已稳定</span></div><div class='learning-result'><div><span class='learning-label'>建议基准流量</span><span class='learning-result-value'>");
            Esp32BaseWeb::writeHtmlEscaped(suggestion);
            Esp32BaseWeb::sendChunk(" L/min</span></div><div><span class='learning-label'>原始脉冲基准</span><span class='learning-result-value'>");
            Esp32BaseWeb::writeHtmlEscaped(baselineRate);
            const uint8_t decisionStart =
                status.learningWindowCount - kLearningDecisionWindowCount;
            uint32_t decisionPulses = 0;
            uint32_t decisionWindowMs = 0;
            for (uint8_t index = decisionStart;
                 index < status.learningWindowCount;
                 ++index) {
                decisionPulses += status.learningWindows[index].pulseCount;
                decisionWindowMs += status.learningWindows[index].windowMs;
            }
            char spreadRate[20]{};
            char allowedRate[20]{};
            formatSignedHundredths(
                status.learningMaximumPulseRateX100 -
                    status.learningMinimumPulseRateX100,
                spreadRate, sizeof(spreadRate));
            formatSignedHundredths(status.learningAllowedPulseRateSpreadX100,
                                   allowedRate, sizeof(allowedRate));
            Esp32BaseWeb::sendChunk(" P/s</span></div></div><p class='learning-rule'>累计采集 <span>");
            sendUnsigned(status.learningTotalWindowCount);
            Esp32BaseWeb::sendChunk("</span> 窗，结果采用 <span>#");
            sendUnsigned(status.learningTotalWindowCount -
                         kLearningDecisionWindowCount + 1U);
            Esp32BaseWeb::sendChunk("～#");
            sendUnsigned(status.learningTotalWindowCount);
            Esp32BaseWeb::sendChunk("</span>；共 <span>");
            sendUnsigned(decisionPulses);
            Esp32BaseWeb::sendChunk(" 个脉冲 / ");
            sendMilliseconds(decisionWindowMs);
            Esp32BaseWeb::sendChunk("</span>。速率跨度 <span>");
            Esp32BaseWeb::writeHtmlEscaped(spreadRate);
            Esp32BaseWeb::sendChunk(" P/s</span>，允许 <span>");
            Esp32BaseWeb::writeHtmlEscaped(allowedRate);
            Esp32BaseWeb::sendChunk(" P/s</span>。流量计系数只用于换算显示流量。</p><div class='learning-actions'><form method='post' action='/irrigation/zones/learning' onsubmit='return once(this)'><input type='hidden' name='action' value='save'><input type='hidden' name='zone_id' value='");
            sendUnsigned(zoneId);
            Esp32BaseWeb::sendChunk("'><input type='hidden' name='revision' value='");
            sendUnsigned(config->revision);
            Esp32BaseWeb::sendChunk("'><div class='actions'><input type='submit' value='保存为基准流量'></div></form>");
        } else {
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER,
                                     "学习结果超出有效范围",
                                     "当前校准系数无法显示该结果，请检查流量计校准参数。");
            Esp32BaseWeb::sendChunk("<div class='learning-actions'>");
        }
        Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/zones/learning' onsubmit='return once(this)'><input type='hidden' name='action' value='discard'><input type='hidden' name='zone_id' value='"); sendUnsigned(zoneId); Esp32BaseWeb::sendChunk("'><div class='actions'><input class='danger' type='submit' value='放弃结果'></div></form></div>");
    } else if (g_app->pendingLearnedZoneId() != 0) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN,
                                 "另一条水路有待确认的学习结果",
                                 "请先返回对应水路保存或放弃该结果。");
    } else {
        if (status.purpose == WateringPurpose::ZoneFlowLearning && status.lastZoneId == zoneId && status.lastStopReason == WateringStopReason::LearningTimeout) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "学习超时", "10 分钟内没有取得稳定流量，请检查供水和管路。");
        Esp32BaseWeb::sendChunk("<p class='muted'>系统每 5 秒统计一次原始脉冲速率；最近 5 个窗口波动不超过 10%，并容忍一个脉冲的计数误差时自动完成。</p>");
    }
    if (baselineManagementAvailable) {
        Esp32BaseWeb::sendChunk("<div class='learning-actions'>");
        if (zone.enabled) {
            Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/zones/learning' onsubmit=\"return confirm('确认开始学习基准流量？开始后这条水路会立即出水。')&&once(this)\"><input type='hidden' name='action' value='start'><input type='hidden' name='zone_id' value='"); sendUnsigned(zoneId); Esp32BaseWeb::sendChunk("'><div class='actions'><input type='submit' value='"); Esp32BaseWeb::sendChunk(zone.baselinePulseRateX10000 == 0 ? "开始学习" : "重新学习"); Esp32BaseWeb::sendChunk("'></div></form>");
        }
        Esp32BaseWeb::sendChunk("<button class='secondary' type='button' onclick=\"document.getElementById('learning-manual').showModal()\">手工设置</button>");
        if (zone.baselinePulseRateX10000 != 0) {
            Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/zones/learning' onsubmit=\"return confirm('确认清除这条水路的基准流量？清除后将停用该水路的高低流量报警。')&&once(this)\"><input type='hidden' name='action' value='clear'><input type='hidden' name='zone_id' value='"); sendUnsigned(zoneId); Esp32BaseWeb::sendChunk("'><input type='hidden' name='revision' value='"); sendUnsigned(config->revision); Esp32BaseWeb::sendChunk("'><div class='actions'><input class='danger' type='submit' value='清除基准'></div></form>");
        }
        Esp32BaseWeb::sendChunk("</div>");
    }
    const bool showLearningWindows =
        (active || g_app->pendingLearnedZoneId() == zoneId) &&
        status.learningWindowCount != 0;
    if (active || showLearningWindows) {
        Esp32BaseWeb::sendChunk("<div class='learning-debug'><h3>最近窗口明细</h3><p>最多显示最近 10 窗，浅色行参与稳定判断；变化值均与上一个可见窗口比较。</p><table class='learning-table'><thead><tr><th>窗口</th><th>实际时长</th><th>脉冲数 / 变化</th><th>脉冲速率</th><th>换算流量 / 变化</th></tr></thead><tbody id='learn-window-body'><tr id='learn-window-empty'");
        if (status.learningWindowCount != 0) {
            Esp32BaseWeb::sendChunk(" style='display:none'");
        }
        Esp32BaseWeb::sendChunk("><td class='learning-empty' colspan='5'>等待第一个完整窗口</td></tr>");
        const uint8_t decisionStart =
            status.learningWindowCount > kLearningDecisionWindowCount
                ? status.learningWindowCount - kLearningDecisionWindowCount
                : 0U;
        for (uint8_t index = 0; index < kLearningHistoryWindowCount; ++index) {
            const bool populated = index < status.learningWindowCount;
            Esp32BaseWeb::sendChunk("<tr id='learn-window-");
            sendUnsigned(index);
            Esp32BaseWeb::sendChunk("' class='");
            if (populated && index >= decisionStart) {
                Esp32BaseWeb::sendChunk("learning-decision");
                if (index == decisionStart) {
                    Esp32BaseWeb::sendChunk(" learning-decision-start");
                }
            }
            Esp32BaseWeb::sendChunk("'");
            if (!populated) Esp32BaseWeb::sendChunk(" style='display:none'");
            Esp32BaseWeb::sendChunk("><td data-label='窗口' id='learn-window-index-");
            sendUnsigned(index);
            Esp32BaseWeb::sendChunk("'>");
            if (populated) {
                Esp32BaseWeb::sendChunk("#");
                sendUnsigned(status.learningWindows[index].sequence);
                if (index + 1U == status.learningWindowCount) {
                    Esp32BaseWeb::sendChunk("<span class='learning-latest'>最新</span>");
                }
            }
            Esp32BaseWeb::sendChunk("</td><td data-label='实际时长' id='learn-window-duration-");
            sendUnsigned(index);
            Esp32BaseWeb::sendChunk("'>");
            if (populated) sendMilliseconds(status.learningWindows[index].windowMs);
            Esp32BaseWeb::sendChunk("</td><td data-label='脉冲数 / 变化'><span class='learning-inline'><span id='learn-window-pulses-");
            sendUnsigned(index);
            Esp32BaseWeb::sendChunk("'>");
            if (populated) sendUnsigned(status.learningWindows[index].pulseCount);
            Esp32BaseWeb::sendChunk("</span><span class='learning-change' id='learn-window-pulse-change-");
            sendUnsigned(index);
            Esp32BaseWeb::sendChunk("'>");
            if (populated) {
                if (index == 0) {
                    Esp32BaseWeb::sendChunk("—");
                } else {
                    char change[24]{};
                    formatIntegerChange(
                        status.learningWindows[index].pulseCount,
                        status.learningWindows[index - 1U].pulseCount,
                        change, sizeof(change));
                    Esp32BaseWeb::writeHtmlEscaped(change);
                }
            }
            Esp32BaseWeb::sendChunk("</span></span></td><td data-label='脉冲速率' id='learn-window-rate-");
            sendUnsigned(index);
            Esp32BaseWeb::sendChunk("'>");
            if (populated) {
                char rate[20]{};
                formatSignedHundredths(status.learningWindows[index].pulseRateX100,
                                       rate, sizeof(rate));
                Esp32BaseWeb::writeHtmlEscaped(rate);
                Esp32BaseWeb::sendChunk(" P/s");
            }
            Esp32BaseWeb::sendChunk("</td><td data-label='换算流量 / 变化'><span class='learning-inline'><span id='learn-window-flow-");
            sendUnsigned(index);
            Esp32BaseWeb::sendChunk("'>");
            if (populated) {
                char flow[20]{};
                IrrigationConfigRules::formatLitersPerMinute(
                    status.learningWindows[index].flowMlPerMinute,
                    flow, sizeof(flow));
                Esp32BaseWeb::writeHtmlEscaped(flow);
                Esp32BaseWeb::sendChunk(" L/min");
            }
            Esp32BaseWeb::sendChunk("</span><span class='learning-change' id='learn-window-flow-change-");
            sendUnsigned(index);
